#include <iostream>
using namespace std;

int total = 0;
string s;

int main()
{
    cin >> s;
    
    // s[i] - 65를 한 결과값
    // A,B,C   : 0,1,2 -> 몫 : 0 -> '2'(3초) 
    // D,E,F   : 3,4,5 -> 몫 : 1 -> '3'(4초)
    // G,H,I   : 6,7,8 -> 몫 : 2 -> '4'(5초)
    // J,K,L   : 9,10,11 -> 몫 : 3 -> '5'(6초)
    // M,N,O   : 12,13,14 -> 몫 : 4 -> '6'(7초)
    // P,Q,R,S : 15,16,17,(18) -> 몫 : 5 -> '7'(8초)
    // T,U,V   : 19,20,(21) -> 몫 : 6 -> '8'(9초)
    // W,X,Y,Z : 22,23,(24),(25) -> 몫 : 7 -> '9'(10초)
    // S,V,Y,Z의 경우에는 몫이 +1씩 초과하므로 계산후에 total 값을 -1씩 줄여줘야한다.
    for (int i = 0; i < s.size(); i++)
    {
        total += ((int)s[i]-65)/3 + 3;    

        if(s[i]=='S'||s[i]=='V'||s[i]=='Y'||s[i]=='Z'){total--;}
    }
    cout << total;
    return 0;
}